Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: You must also write the required modifier before every subclass implementation of a required initializer, to indicate that the initializer requirement applies to further subclasses in the chain.
ja: あなたはまた、required修飾子を必須イニシャライザの全てのサブクラス実装の前に書かなければなりません、そうすることでそのイニシャライザ要件がさらにその連鎖のサブクラスに適用されることを指し示します。

source: You must always declare a lazy property as a variable (with the var keyword), because its initial value might not be retrieved until after instance initialization completes.
ja: あなたは常に遅延プロパティを変数として（varキーワードを使って）宣言しなければなりません、なぜならその最初の値はインスタンスの初期化が完了する後まで取り出されないかもしれないからです。

source: You must always state both the name and the type of the property you are overriding, to enable the compiler to check that your override matches a superclass property with the same name and type.
ja: あなたは、常にあなたがオーバーライドしているプロパティの名前と型を明確に述べなければなりません、そうすることであなたのオーバーライドがスーパークラスの同じ名前と型をもつプロパティと合致することをコンパイラが確認できるようになります。

source: You must declare computed properties—including read-only computed properties—as variable properties with the var keyword, because their value is not fixed.
ja: あなたは、計算プロパティ ― 読み出し専用の計算プロパティを含む ― をvarキーワードをつかって変数プロパティとして宣言しなければなりません、なぜならそれらの値は固定されないからです。

source: You must specify the access level explicitly as part of the function’s definition if the function’s calculated access level doesn’t match the contextual default.
ja: その関数の計算されたアクセス水準が省略時の文脈に合致しないと思うならば、あなたは関数の定義の一部として明確にアクセス水準を指定しなければなりません。

source: You need to mark an entity as open or public only if you want it to become part of your framework’s API.
ja: あなたは、それにあなたのフレームワークのもつAPIの一部になってほしいならば、ある実在を開放または公開として印する必要があります。

source: You now write prefix operator rather than operator prefix, for example.
ja: あなたは今や、prefix operatorと書きます、operator prefixではなく、例えば。

source: You pass this function an expression that evaluates to true or false and a message to display if the result of the condition is false.
ja: あなたはこの関数に、trueまたはfalseに評価する式と条件の結果がfalseであるならば表示するメッセージを渡します。

source: You pass this initializer a default value of the appropriate type (called repeating): and the number of times that value is repeated in the new array (called count):
ja: あなたは、このイニシャライザに対して、適切な型のひとつの初期値（repeatingと呼ばれます）、そしてその値が新しい配列の中で繰り返される回数（countと呼ばれます）とを渡します：

source: You perform this comparison with the “equal to” operator (==) or the “not equal to” operator (!=).
ja: あなたは、この比較を「同等」演算子（==）または「不等」演算子（!=）を使って実行します。

source: You place an ampersand (&) directly before a variable’s name when you pass it as an argument to an in-out parameter, to indicate that it can be modified by the function.
ja: あなたは変数の名前の直前に、あなたがin-outパラメータに対する引数としてそれを渡すときに、それが関数によって修正されることができることを示すために、アンパサンド（&）を置きます。

source: You place your string within quotation marks (") and surround that with number signs (#).
ja: あなたは、あなたの文字列を引用符（"）内に置きます、そしてそれをシャープ記号（#）で囲みます。

source: You provide an implementation of the == operator in the same way as you implement other infix operators:
ja: あなたは、==演算子の実装を、あなたが他の接中辞演算子を実装するのと同じ方法で提供します。

source: You represent errors using any type that adopts the Error protocol.
ja: あなたは、Errorプロトコルを採用するどんな型でも使用してエラーを表します。

source: You resolve a strong reference cycle between a closure and a class instance by defining a capture list as part of the closure’s definition.
ja: あなたは、クロージャの定義の一部として捕獲リストを定義することによってクロージャとクラスインスタンスの間で強い参照循環を解消します。

source: You resolve strong reference cycles by defining some of the relationships between classes as weak or unowned references instead of as strong references.
ja: あなたは、クラス間の関係の一部を強い参照としてでなくて弱い、または非所有参照として定義することによって強い参照循環を解消します。

source: You saw above how a strong reference cycle can be created when two class instance properties hold a strong reference to each other.
ja: あなたは上で、２つのクラスインスタンスプロパティが強い参照にお互いを守らせるとき、どのように強い参照循環がつくられることができるかを見ました。

source: You set an optional variable to a valueless state by assigning it the special value nil:
ja: あなたが、あるオプショナルの変数を値が無い状態へと設定するには、それに特別な値nilを代入します：

source: You specify a declaration modifier by writing the appropriate keyword or context-sensitive keyword between a declaration’s attributes (if any) and the keyword that introduces the declaration.
ja: あなたは、宣言修飾子を適切なキーワードまたは文脈依存キーワードを宣言の属性（もしあれば）と宣言を導入するキーワードとの間に書くことによって指定します。

source: You specify a default property value by assigning an initial value to the property when it is defined.
ja: あなたは、それが定義されるときプロパティに初期値を代入することによって、省略時のプロパティ値を指定します。

source: You specify an attribute by writing the @ symbol followed by the attribute’s name and any arguments that the attribute accepts:
ja: あなたは、@記号に続いてその属性の名前そしてその属性が受け入れる任意の引数を書くことによって属性を指定します：

source: You specify optional chaining by placing a question mark (?) after the optional value on which you wish to call a property, method or subscript if the optional is non-nil.
ja: あなたはオプショナル連鎖を、そのオプショナルがnilで無いならばあなたがプロパティ、メソッド、または添え字を呼び出したいオプショナルの値の後に疑問符（?）を置くことによって指定します。

source: You specify the associativity of an operator by writing one of the context-sensitive keywords left, right, or none—if your omit the associativity, the default is none.
ja: あなたはある演算子の結合性を文脈依存キーワードleft、right、またはnoneのうちの１つを書くことによって指定します—あなたが結合性を省略するならば、初期状態はnoneです。

source: You typically define a failable initializer that creates an optional instance of the appropriate type by placing a question mark after the init keyword (init?).
ja: あなたは一般的に、適切な型のオプショナルのインスタンスを作成する失敗できるイニシャライザを、疑問符をinitキーワードの後において（init?）定義します。

source: You typically use internal access when defining an app’s or a framework’s internal structure.
ja: あなたは概して内部アクセスを、アプリのまたはフレームワークの内部用の構造体を定義するときに使います。

source: You typically use open or public access when specifying the public interface to a framework.
ja: あなたは概して開放または公開アクセスを、あるフレームワークに公開インタフェースを指定するときに使います。

source: You use for-in to iterate over items in a dictionary by providing a pair of names to use for each key-value pair.
ja: あなたはfor-inを使って、辞書の中の項目のすべてに対して繰り返すことを、一対の名前を提供してそれぞれの「キーと値」の対に使用することで行います。

source: You use try? to handle an error by converting it to an optional value.
ja: あなたは、try?を使って、あるエラーをオプショナルの値に変換することによって取り扱うことができます。

source: You use error handling to respond to error conditions your program may encounter during execution.
ja: あなたは、エラー処理を使ってあなたのプログラムが実行の間に遭遇するエラー状態に応答することができます。

source: You use optional binding to find out whether an optional contains a value, and if so, to make that value available as a temporary constant or variable.
ja: あなたは、あるオプショナルが値を含むかどうか知るために、そしてもしそうならば、その値を一時的な定数または変数として利用可能にするために、オプショナル束縛を使うことができます。

source: You use optionals in situations where a value may be absent.
ja: あなたはオプショナルを、ある値が不在かもしれない状況において使います。

source: You use a defer statement to execute a set of statements just before code execution leaves the current block of code.
ja: あなたはdefer文を使うことで、コード実行が現在のコードブロックから離れる直前に一揃いの文を実行するようにします。

source: You use a do-catch statement to handle errors by running a block of code.
ja: あなたは、あるコードの塊を実行することによってエラーを処理するために、do-catch文を使います。

source: You use a throw statement to throw an error.
ja: あなたはthrow文を使ってエラーをスローします。

source: You use a guard statement to require that a condition must be true in order for the code after the guard statement to be executed.
ja: あなたはguard文を使って、guard文の後のコードが実行されるためにはある条件が真でなけれればならないことを要求します。

source: You use a dictionary when you need to look up values based on their identifier, in much the same way that a real-world dictionary is used to look up the definition for a particular word.
ja: 現実世界の辞書が特定の語の定義を調べるために使われるのと全く同様に、あなたが値をそれらの識別子に基づいて調べる必要があるとき、あなたは辞書を使用します。

source: You use a generic where clause in a protocol declaration to add constraints to an associated types inherited from another protocol, without redeclaring the associated types.
ja: あなたは、総称体where節をプロトコル宣言の中で使うことで、別のプロトコルから継承された関連型に制約を追加します、その関連型を再宣言することなしに。

source: You use a variadic parameter to specify that the parameter can be passed a varying number of input values when the function is called.
ja: あなたは可変長パラメータを、関数が呼ばれる時にそのパラメータが変動する数の入力値を渡されることができることを示すために使います。

source: You use an availability condition in an if or guard statement to conditionally execute a block of code, depending on whether the APIs you want to use are available at runtime.
ja: あなたは、有効性条件をifまたはguard文の中で使って、あなたが使用したいAPIが実行時に有効かどうかに基づいて、条件付きでコードブロックを実行します。

source: You use an availability condition to execute a block of code, depending on whether the APIs you want to use are available at runtime.
ja: あなたは、有効性条件を使って、あなたが使用したいAPIが実行時に有効かどうかに基づいて、あるコードのブロックを実行します。

source: You use assertions and preconditions to express the assumptions you make and the expectations you have while coding, so you can include them as part of your code.
ja: あなたは表明と前提条件を使うことであなたのする想定とあなたが持つ期待をコーディングの間に表します、それであなたはそれらをあなたのコードの一部として含めることができます。

source: You use function types just like any other types in Swift.
ja: あなたは、関数型をスウィフトでのあらゆる他の型と同じように使います。

source: You use it to create logical expressions in which only one of the two values has to be true for the overall expression to be true.
ja: あなたはそれを、全体的な式がtrueになるためには２つの値のうちの１つだけがtrueであればよい論理式をつくるために使います。

source: You use key-path expressions in dynamic programming tasks, such as key-value observing.
ja: あなたはキーパス式を動的なプログラミング作業、例えばキー値監視などにおいて使用します。

source: You use platform names such as iOS, macOS, watchOS, and tvOS—for the full list, see Declaration Attributes.
ja: あなたは、例えばiOS、macOS、watchOS、そしてtvOSのようなプラットホーム名を使います—完全なリストのために、宣言属性を見てください。

source: You use subscripts to set and retrieve values by index without needing separate methods for setting and retrieval.
ja: あなたは添え字を使うことで、独立したメソッドを設定や検索のために必要とすることなしに、インデックスによって値を設定したり取得したりします。

source: You use the for-in loop to iterate over a sequence, such as items in an array, ranges of numbers, or characters in a string.
ja: あなたはfor-inループを、ある連続物について、例えば配列の中の項目、数の範囲、または文字列の中の文字について、それに含まれるすべてに繰り返していくために使用します。

source: You use the nonobjc attribute to resolve circularity for bridging methods in a class marked with the objc attribute, and to allow overloading of methods and initializers in a class marked with the objc attribute.
ja: あなたは、objc属性で印されるクラスの中のブリッジしているメソッドに対する循環性を解決するために、そしてobjc属性で印されるクラスにおいてメソッドとイニシャライザをオーバーロードすることを許可するためにnonobjc属性を使います。

source: You use the self property to distinguish between the parameter name and the property name.
ja: あなたは、selfプロパティをパラメータ名とプロパティ名を区別するために使います。

source: You use the self property to refer to the current instance within its own instance methods.
ja: あなたは、selfプロパティを現在のインスタンスに言及するためにそれ自身のインスタンスメソッド内で使います。

source: You use the case keyword to introduce new enumeration cases.
ja: あなたはcaseキーワードを使って、新しい列挙ケース節を導入することができます。

source: You use the initializer expression in a function call expression to initialize a new instance of a type.
ja: あなたは、イニシャライザ式を関数呼び出し式において使うことで、ある型の新しいインスタンスを初期化します。

source: You use the runtime name when calling functions that interact with the Objective-C runtime, like NSClassFromString [https://developer.apple.com/documentation/foundation/1395135-nsclassfromstring], and when specifying class names in an app’s Info.plist file.
ja: あなたはランタイム名を、Objective-Cランタイムと相互作用する関数、NSClassFromString [https://developer.apple.com/documentation/foundation/1395135-nsclassfromstring]などを呼び出す時に、そしてクラス名をアプリのもつInfo.plistファイルの中で指定する時に使います。

source: You use them to make sure an essential condition is satisfied before executing any further code.
ja: あなたはそれらを使って、必要不可欠な条件が満たされるのを何らかのその先のコードが実行される前に確実なものにします。

source: You use these patterns in a case label of a switch statement, a catch clause of a do statement, or in the case condition of an if, while, guard, or for-in statement.
ja: あなたはこれらのパターンをswitch文のケース節ラベル、do文のcatch節において、またはif、while、guard、およびfor-in文のケース節条件において使用します。

source: You usually implement the == operator, and use the standard library’s default implementation of the != operator that negates the result of the == operator.
ja: あなたは普通は==演算子を実装します、そして標準ライブラリのもつ!=演算子の省略時の実装を使います、それは==演算子の結果を否定するものです。

source: You want to draw 60 tick marks, starting with the 0 minute.
ja: あなたは、0分から開始して、60個の目盛りを描こうと思います。

source: You write return nil within a failable initializer to indicate a point at which initialization failure can be triggered.
ja: あなたは失敗できるイニシャライザの内部でreturn nilを書くことで、そこにおいて初期化失敗が引き起こされる可能性がある地点を指し示します。

source: You write a failable initializer by placing a question mark after the init keyword (init?).
ja: あなたは、失敗可能なイニシャライザを疑問符をinitキーワードの後に置くこと（init?）によって記述します。

source: You write a generic where clause right before the opening curly brace of a type or function’s body.
ja: あなたは、総称体where節を、型や関数のもつ本文の開き波括弧のまさに前に記述します。

source: You write a pattern after catch to indicate what errors that clause can handle.
ja: あなたは、catchの後にあるパターンを書いてどんなエラーをその節が取り扱えるかを指し示します。

source: You write a pattern after catch just as you do after case in a switch.
ja: あなたは、まさにあなたがスイッチにおいてcaseの後にするように、catchの後にひとつのパターンを書きます。

source: You write a precondition by calling the precondition(_:_:file:line:) [https://developer.apple.com/documentation/swift/1540960-precondition] function.
ja: あなたは、前提条件をprecondition(_:_:file:line:) [https://developer.apple.com/documentation/swift/1540960-precondition]関数を呼び出すことによって記述します。

source: You write an argument label before the parameter name, separated by a space:
ja: あなたは引数ラベルを、パラメーター名の前に、空白で区切って書きます：

source: You write an assertion by calling the assert(_:_:file:line:) [https://developer.apple.com/documentation/swift/1541112-assert] function from the Swift standard library.
ja: あなたは表明をassert(_:_:file:line:) [https://developer.apple.com/documentation/swift/1541112-assert]関数をSwift標準ライブラリから呼び出すことによって記述します。

source: You write an implicitly unwrapped optional by placing an exclamation point (String!) rather than a question mark (String?) after the type that you want to make optional.
ja: あなたは暗黙的にアンラップされるオプショナルを、あなたがオプショナルを作りたい型の後に疑問符（String?）ではなく感嘆符（String!）を置くことによって記述します。

source: You write an in-out parameter by placing the inout keyword right before a parameter’s type.
ja: あなたは、パラメータの型のすぐ前にinoutキーワードを置くことによってin-outパラメータを書きます。

source: You write an instance method within the opening and closing braces of the type it belongs to.
ja: あなたは、インスタンスメソッドを、それが属している型の開始と終わりの波括弧の内部に書きます。

source: You write an optional tuple return type by placing a question mark after the tuple type’s closing parenthesis, such as (Int, Int)? or (String, Int, Bool)?.
ja: あなたはオプショナルタプルの戻り型をタプル型の閉じ括弧の後に疑問符を置くことによって書きます、例えば(Int, Int)?または(String, Int, Bool)?など。

source: You write deinitializers with the deinit keyword, similar to how initializers are written with the init keyword.
ja: あなたは、イニシャライザがinitキーワードで書かれる方法と同様に、デイニシャライザをdeinitキーワードを使って書きます。

source: You write nested comments by starting a multiline comment block and then starting a second multiline comment within the first block.
ja: あなたはひとつの複数行コメント・ブロックを始めて、それから第二の複数行を最初のブロック以内に始めることによって入れ子にされたコメントを書きます。

source: You write subscript definitions with the subscript keyword, and specify one or more input parameters and a return type, in the same way as instance methods.
ja: あなたは、添え字定義をsubscriptキーワードを使って書きます、そしてインスタンスメソッドと同じ方法で、１つ以上の入力パラメータと戻り型を指定します。

source: You write the diagnostic message as a static string literal.
ja: あなたは、診断メッセージを静的文字列リテラルとして書きます。

source: You write the placeholder type name inside angle brackets after subscript, and you write a generic where clause right before the opening curly brace of the subscript’s body.
ja: あなたは、プレースホルダ型名を山括弧の内部にsubscriptの後に書きます、そしてあなたは総称体where節を添え字本文の開き波括弧の直前に書きます。

source: You write these constraints after the name of the protocol you’re extending by writing a generic where clause.
ja: あなたはこれらの制約を、総称体where節を書くことによってあなたが拡張しているプロトコルの名前の後に書きます。

source: You write these initializers as part of the protocol’s definition in exactly the same way as for normal initializers, but without curly braces or an initializer body:
ja: あなたは、これらのイニシャライザをプロトコル定義の一部として普通のイニシャライザと正確に同じ方法で書くことができます、しかし波括弧またはイニシャライザ本文はありません：

source: You write type constraints by placing a single class or protocol constraint after a type parameter’s name, separated by a colon, as part of the type parameter list.
ja: あなたは、型パラメーターリストの一部として、型パラメータの名前の後にコロンで区切って１つのクラスまたはプロトコル制約を置くことによって、型制約を書きます。

source: Your code can interact with these identifiers, but you can’t declare identifiers with that prefix.
ja: あなたのコードは、それらの識別子と相互作用できます、しかしあなたは識別子をその接頭辞で宣言できません。

source: You’re accessing only stored properties of an instance, not computed properties or class properties.
ja: あなたがインスタンスの格納プロパティだけにアクセスしている、計算プロパティやクラスプロパティではなく。

source: You’re likely to encounter this kind of error in two kinds of situations.
ja: あなたは、この種のエラーに２種類の状況において出くわしそうに思われます。

source: You’re not limited to the predefined operators.
ja: あなたは、あらかじめ定義された演算子に制限されていません。

source: You’ve actually been using value types extensively throughout the previous chapters.
ja: あなたは、実際に前の章を通して広く値型を使っていました。

source: Zeros are inserted in the spaces left behind after the original bits are moved to the left or right.
ja: 元のビットが左または右へ移動した後に残される空きに、ゼロが差し込まれます。

source: Zeros become ones, and ones become zeros.
ja: ゼロは１になります、そして１はゼロになります。

source: but is written over multiple lines.
ja: （しかし複数行にわたって書かれます。）

source: giving a remainder value of -1.
ja: そして-1の余り値を与えます。

source: where some multiplier is the largest number of multiples of b that will fit inside a.
ja: ここでsome multiplierはbの倍数でaの内部に収まる最も大きな数です。

source: “A function that has two parameters, both of type Int, and that returns a value of type Int.”
ja: 「２つのパラメータを持ち、両方とも型Intで、そして型Intの値をひとつ返す関数」

source: “Consider the value of directionToHead.
ja: 「directionToHeadの値を考慮する。

source: “Declare a new constant called maximumNumberOfLoginAttempts, and give it a value of 10.
ja: 「maximumNumberOfLoginAttemptsと呼ばれるある新しい定数を宣言して、それに10というひとつの値を与える。

source: “Declare a variable called welcomeMessage that is of type String.”
ja: 「welcomeMessageと呼ばれる型Stringの変数を宣言する。」

source: “Define a variable called mathFunction, which has a type of ‘a function that takes two Int values, and returns an Int value.’ Set this new variable to refer to the function called addTwoInts.”
ja: 「『２つのInt値をとり、１つのInt値を返す関数』の型を持ち、mathFunctionと呼ばれる、ある変数を定義する。この新しい変数をaddTwoIntsと呼ばれる関数に言及するように設定する。」

source: “Define an enumeration type called Barcode, which can take either a value of upc with an associated value of type (Int, Int, Int, Int), or a value of qrCode with an associated value of type String.”
ja: 「Barcodeと呼ばれる列挙型を定義します、それはupcの値で型（Int、Int、Int、Int）の関連値をもつ、またはqrCodeの値で型Stringの関連値をもつものをとることができます。」

source: “If the optional Int returned by Int(possibleNumber) contains a value, set a new constant called actualNumber to the value contained in the optional.”
ja: 「Int(possibleNumber)によって返されるオプショナルのIntが値を含むならば、ある新しい定数actualNumberをそのオプショナルに含まれる値に設定してください。」

source: “Try to access item as a Movie.
ja: 「itemにMovieとしてアクセスを試みてください。

source: …and so on.
ja: …などなど。

source: …and so on:
ja: …などなど：
